class SearchFormData {
    constructor () {
        this.selectsData = [
            {
                name: 'В прокат',
                id: 1,
                subCat: [
                    {
                        name: 'Велосипед',
                        id: '',
                        subCat: [
                            {
                                name: 'Шоссейный',
                                id: ''
                            },
                            {
                                name: 'Горный',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Хардтейл',
                                id: ''
                            },
                            {
                                name: 'Двухподвес',
                                id: ''
                            },
                            {
                                name: 'Фэтбайк',
                                id: ''
                            },
                            {
                                name: 'Электробайк',
                                id: ''
                            },
                            {
                                name: 'Складывающийся',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Гироскутер',
                        id: '',
                        subCat: [
                            {
                                name: 'Шоссейный',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Внедорожный',
                                id: ''
                            },
                            {
                                name: 'Скоростной',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Самокат',
                        id: '',
                        subCat: [
                            {
                                name: 'Городской',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Внедорожный',
                                id: ''
                            },
                            {
                                name: 'Трюковый',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Роликовые коньки',
                        id: '',
                        subCat: [
                            {
                                name: 'Детские',
                                id: ''
                            },
                            {
                                name: 'Профессиональные',
                                id: ''
                            },
                            {
                                name: 'Трюковые',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Зимняя техника',
                        id: '',
                        subCat: [
                            {
                                name: 'Сноуборды',
                                id: ''
                            },
                            {
                                name: 'Лыжи',
                                id: ''
                            },
                            {
                                name: 'Санки',
                                id: ''
                            },
                            {
                                name: 'Снегокаты',
                                id: ''
                            },
                            {
                                name: 'Ледянки',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Аксессуары и туристическое оборудование',
                        id: '',
                        subCat: [
                            {
                                name: 'Экшн-камеры',
                                id: ''
                            },
                            {
                                name: 'Защитное снаряжение',
                                id: ''
                            },
                            {
                                name: 'Палатки',
                                id: ''
                            },
                            {
                                name: 'Спальные мешки',
                                id: ''
                            },
                            {
                                name: 'Рюкзаки туристические',
                                id: ''
                            },
                            {
                                name: 'Другое',
                                id: ''
                            }
                        ]
                    }
                ]
            },
            {
                name: 'В подарок',
                id: 2,
                subCat: [
                    {
                        name: 'ПВелосипед',
                        id: '',
                        subCat: [
                            {
                                name: 'Шоссейный',
                                id: ''
                            },
                            {
                                name: 'Горный',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Хардтейл',
                                id: ''
                            },
                            {
                                name: 'Двухподвес',
                                id: ''
                            },
                            {
                                name: 'Фэтбайк',
                                id: ''
                            },
                            {
                                name: 'Электробайк',
                                id: ''
                            },
                            {
                                name: 'Складывающийся',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'ПГироскутер',
                        id: '',
                        subCat: [
                            {
                                name: 'Шоссейный',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Внедорожный',
                                id: ''
                            },
                            {
                                name: 'Скоростной',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Самокат',
                        id: '',
                        subCat: [
                            {
                                name: 'Городской',
                                id: ''
                            },
                            {
                                name: 'Детский',
                                id: ''
                            },
                            {
                                name: 'Внедорожный',
                                id: ''
                            },
                            {
                                name: 'Трюковый',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Роликовые коньки',
                        id: '',
                        subCat: [
                            {
                                name: 'Детские',
                                id: ''
                            },
                            {
                                name: 'Профессиональные',
                                id: ''
                            },
                            {
                                name: 'Трюковые',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Зимняя техника',
                        id: '',
                        subCat: [
                            {
                                name: 'Сноуборды',
                                id: ''
                            },
                            {
                                name: 'Лыжи',
                                id: ''
                            },
                            {
                                name: 'Санки',
                                id: ''
                            },
                            {
                                name: 'Снегокаты',
                                id: ''
                            },
                            {
                                name: 'Ледянки',
                                id: ''
                            }
                        ]
                    },
                    {
                        name: 'Аксессуары и туристическое оборудование',
                        id: '',
                        subCat: [
                            {
                                name: 'Экшн-камеры',
                                id: ''
                            },
                            {
                                name: 'Защитное снаряжение',
                                id: ''
                            },
                            {
                                name: 'Палатки',
                                id: ''
                            },
                            {
                                name: 'Спальные мешки',
                                id: ''
                            },
                            {
                                name: 'Рюкзаки туристические',
                                id: ''
                            },
                            {
                                name: 'Другое',
                                id: ''
                            }
                        ]
                    }
                ]
            }
        ];
        this.searchData = [
            {
                name: 'в Москве',
                id: 1
            },
            {
                name: 'в Питере',
                id: 2
            },
            {
                name: 'в Баку',
                id: 3
            },
            {
                name: 'в Ростове',
                id: 4
            },
            {
                name: 'в Магадане',
                id: 5
            }
        ];
    }
}

export default SearchFormData;